In [1]:
import pandas as pd

### Loading Datasets

In [2]:
titles = pd.read_csv('titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [3]:
casts = pd.read_csv('cast.csv')
casts.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [4]:
print(f"There are {len(titles)} movies listed in this dataframe.")

There are 244914 movies listed in this dataframe.

### What are the earliest two films listed in the titles dataframe?

In [5]:
print("The two earliest films are:")
earliest_films = titles.sort_values('year').head(2)
for i in range(len(earliest_films)):
    print(f"{i +1}. {earliest_films['title'].values[i]} ({earliest_films['year'].values[i]})")

The two earliest films are:
1. Miss Jerry (1894)
2. The Startled Lover (1898)

### How many movies have the title "Hamlet"?

In [6]:
print(f"There are {len(titles[titles.title == 'Hamlet'])} movies that have the title 'Hamlet'.")

There are 20 movies that have the title 'Hamlet'.

### How many movies are titled "North by Northwest"?

In [7]:
print(f"There are {len(titles[titles.title == 'North by Northwest'])} movies that have the title 'North by Northwest'.")

There are 1 movies that have the title 'North by Northwest'.

### When was the first movie titled "Hamlet" made?

In [8]:
year = str(titles[titles.title == 'Hamlet'].sort_values('year').head(1)['year'].values[0])

In [9]:
print("The first movie titled 'Hamlet' was made in", year)

The first movie titled 'Hamlet' was made in 1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [10]:
treasure_island = titles[titles.title == 'Treasure Island'].sort_values('year')
for i in range(len(treasure_island)):
    print(f"{i +1}. {treasure_island['title'].values[i]} ({treasure_island['year'].values[i]})")

1. Treasure Island (1918)
2. Treasure Island (1920)
3. Treasure Island (1934)
4. Treasure Island (1950)
5. Treasure Island (1972)
6. Treasure Island (1973)
7. Treasure Island (1985)
8. Treasure Island (1999)

### How many movies were made in the year 1950?

In [11]:
print(len(titles[titles.year == 1950]), "movies were made in 1950.")

1113 movies were made in 1950.

### How many movies were made in the year 1960?

In [12]:
print(len(titles[titles.year == 1960]), "movies were made in 1960.")

1549 movies were made in 1960.

In [13]:
print(len(titles[titles.year.between(1950, 1959)]), "movies were made from 1950 through 1959.")

12934 movies were made from 1950 through 1959.

### In what years has a movie titled "Batman" been released

In [14]:
print("'Batman' has been released in:")

years = titles[titles.title == 'Batman'].sort_values('year')
for i in range(len(years)):
    print(f"{i +1}. {years['year'].values[i]}")

'Batman' has been released in:
1. 1943
2. 1989

### How many roles were there in the movie "Inception"?

In [15]:
print(f"There were {len(casts[casts.title == 'Inception'])} roles in 'Inception'.")

There were 28 roles in 'Inception'.

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [16]:
print(len(casts[(casts.title == 'Inception') & (casts['n'].isna())]), 'roles in the movie "Inception" are NOT ranked by an "n" value')

9 roles in the movie "Inception" are NOT ranked by an "n" value

### But how many roles in the movie "Inception" did receive an "n" value?

In [17]:
print(len(casts[(casts.title == 'Inception') & (casts['n'].notna())]), 'roles in the movie "Inception" are ranked by an "n" value')

19 roles in the movie "Inception" are ranked by an "n" value

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [18]:
casts[(casts.title == 'North by Northwest') & casts.n.notnull()].sort_values('n')

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [19]:
casts[(casts.title == 'Sleuth') & (casts.year == 1972)].sort_values('n')

         title  year            name   type          character    n
326773  Sleuth  1972   Michael Caine  actor        Milo Tindle  2.0
373876  Sleuth  1972  Alec Cawthorne  actor  Inspector Doppler  3.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [20]:
casts[(casts.title == 'Sleuth') & (casts.year == 2007)].sort_values('n')

         title  year                 name   type          character    n
326774  Sleuth  2007        Michael Caine  actor             Andrew  1.0
260242  Sleuth  2007      Kenneth Branagh  actor  Other Man on T.V.  NaN
373877  Sleuth  2007  Alec (II) Cawthorne  actor  Inspector Doppler  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [21]:
print(len(casts[(casts.title == 'Hamlet') & (casts.year == 1921)]), "roles were credited in the silent 1921 version of Hamlet")

3 roles were credited in the silent 1921 version of Hamlet

### How many roles were credited in Branagh’s 1996 Hamlet?

In [22]:
print(len(casts[(casts.title == 'Hamlet') & (casts.year == 1996)]), "roles were credited in Branagh’s 1996 Hamlet")

22 roles were credited in Branagh’s 1996 Hamlet

### How many "Hamlet" roles have been listed in all film credits through history?

In [23]:
print(len(casts[casts.title == 'Hamlet']), "'Hamlet' roles have been listed in all film credits through history")

117 'Hamlet' roles have been listed in all film credits through history

### How many people have played an "Ophelia"?

In [24]:
print(len(casts[casts.character == "Ophelia"]), 'people have played "Ophelia".')

4 people have played "Ophelia".

### How many people have played a role called "The Dude"?

In [25]:
print(len(casts[casts.character == "The Dude"]), 'people have played "The Dude".')

7 people have played "The Dude".

### How many people have played a role called "The Stranger"?

In [26]:
print(len(casts[casts.character == "The Stranger"]), 'people have played "The Stranger".')

84 people have played "The Stranger".

### How many roles has Sidney Poitier played throughout his career?

In [27]:
print(len(casts[casts.character == 'Sidney Poitier']), "roles Sidney Poitier has played throughout his career")

1 roles Sidney Poitier has played throughout his career

### How many roles has Judi Dench played?

In [28]:
print(len(casts[casts.name == 'Judi Dench']), "roles Judi Dench has played")

0 roles Judi Dench has played

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [29]:
casts[(casts.name == 'Cary Grant') & (casts.year == 1940) & (casts.n == 2) ]

                   title  year        name   type   character    n
871423  My Favorite Wife  1940  Cary Grant  actor  Nick Arden  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [30]:
casts[(casts.name == 'Cary Grant') & (casts.year == 1940) & (casts.n == 1)]

,title,year,name,type,character,n
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0

### How many roles were available for actors in the 1950s?

In [31]:
print(len(casts[(casts.year == 1950) & (casts.type == 'actor')]), "roles were available for actors in the 1950s.")

7289 roles were available for actors in the 1950s.

### How many roles were available for actresses in the 1950s?

In [32]:
print(len(casts[(casts.year == 1950) & (casts.type == 'actress')]), "roles were available for actors in the 1950s.")

0 roles were available for actors in the 1950s.

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [33]:
print(len(casts[(casts.n == 1) & (casts.year <= 1980)]), "leading roles were available from the beginning of film history through 1980.")

18588 leading roles were available from the beginning of film history through 1980.

### How many non-leading roles were available through from the beginning of film history through 1980?

In [34]:
print(len(casts[(casts.n != 1) & (casts.year <= 1980)]), "non-leading roles were available from the beginning of film history through 1980.")

346128 non-leading roles were available from the beginning of film history through 1980.

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [35]:
print(len(casts[(casts.n.isna()) & (casts.year == 1980)]), "roles through 1980 were minor enough that they did not warrant a numeric 'n' rank.")

1251 roles through 1980 were minor enough that they did not warrant a numeric 'n' rank.